export const reviews = [
  {
    user: "Юлия",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "07.03.2025",
  },
  {
    user: "Татьяна",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "20.02.2025",
  },
  {
    user: "Юлия",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "26.04.2025",
  },
  {
    user: "Сергей",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "15.04.2025",
  },
  {
    user: "Светлана",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "29.01.2025",
  },
  {
    user: "Наталья",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "12.04.2025",
  },
  {
    user: "Артем",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "07.02.2025",
  },
  {
    user: "Татьяна",
    review:
      "Читаю канал уже несколько недель — контент, в целом, нормальный. Иногда попадаются дельные посты.",
    date: "27.01.2025",
  },
  {
    user: "Сергей",
    review:
      "Посты бывают полезные, но, честно говоря, не всегда. Канал всё ещё в закладках.",
    date: "26.03.2025",
  },
  {
    user: "Татьяна",
    review:
      "Контент в основном нейтральный, без ярко выраженной позиции. Это плюс, если хочется просто информации.",
    date: "19.01.2025",
  },
  {
    user: "Ксения",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "06.02.2025",
  },
  {
    user: "Алексей",
    review:
      "Сейчас столько каналов с однотипным контентом. Этот хоть как-то отличается спокойствием.",
    date: "10.04.2025",
  },
  {
    user: "Светлана",
    review:
      "Периодически захожу почитать, когда выдается свободное время. Интерес есть, но не постоянный.",
    date: "17.01.2025",
  },
  {
    user: "Светлана",
    review:
      "Сейчас столько каналов с однотипным контентом. Этот хоть как-то отличается спокойствием.",
    date: "26.04.2025",
  },
  {
    user: "Светлана",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "23.01.2025",
  },
  {
    user: "Елена",
    review:
      "Могли бы уделять больше внимания деталям, но за стабильность публикаций — плюс.",
    date: "04.05.2025",
  },
  {
    user: "Ольга",
    review:
      "Контент в основном нейтральный, без ярко выраженной позиции. Это плюс, если хочется просто информации.",
    date: "07.02.2025",
  },
  {
    user: "Никита",
    review:
      "Формат подачи информации понятный, хотя иногда не хватает примеров из практики.",
    date: "04.02.2025",
  },
  {
    user: "Артем",
    review:
      "Сейчас столько каналов с однотипным контентом. Этот хоть как-то отличается спокойствием.",
    date: "12.05.2025",
  },
  {
    user: "Татьяна",
    review:
      "Было бы неплохо добавить больше интерактива с подписчиками — пока всё очень односторонне.",
    date: "04.01.2025",
  },
  {
    user: "Сергей",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "18.02.2025",
  },
  {
    user: "Алина",
    review:
      "Не всегда понимаю, для какой аудитории предназначен контент. Но, возможно, это и делает его универсальным.",
    date: "20.02.2025",
  },
  {
    user: "Никита",
    review:
      "Всё спокойно, без излишнего хайпа. Это мне и нравится. Можно читать на фоне.",
    date: "16.02.2025",
  },
  {
    user: "Наталья",
    review:
      "Тематика вроде интересная, но хотелось бы побольше оригинального контента, а не просто репостов.",
    date: "17.04.2025",
  },
  {
    user: "Наталья",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "05.02.2025",
  },
  {
    user: "Алина",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "05.02.2025",
  },
  {
    user: "Татьяна",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "05.05.2025",
  },
  {
    user: "Владимир",
    review:
      "Посты бывают полезные, но, честно говоря, не всегда. Канал всё ещё в закладках.",
    date: "28.01.2025",
  },
  {
    user: "Мария",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "01.05.2025",
  },
  {
    user: "Роман",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "01.03.2025",
  },
  {
    user: "Сергей",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "14.02.2025",
  },
  {
    user: "Алина",
    review:
      "Тематика вроде интересная, но хотелось бы побольше оригинального контента, а не просто репостов.",
    date: "07.04.2025",
  },
  {
    user: "Анна",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "22.03.2025",
  },
  {
    user: "Максим",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "17.03.2025",
  },
  {
    user: "Ксения",
    review:
      "Некоторые посты явно писались наспех, но в общем и целом выглядит прилично.",
    date: "24.01.2025",
  },
  {
    user: "Алина",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "17.01.2025",
  },
  {
    user: "Роман",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "03.05.2025",
  },
  {
    user: "Ольга",
    review:
      "Контент в основном нейтральный, без ярко выраженной позиции. Это плюс, если хочется просто информации.",
    date: "28.03.2025",
  },
  {
    user: "Алексей",
    review:
      "Приятно, что авторы не навязывают своё мнение, а просто делятся материалами.",
    date: "14.03.2025",
  },
  {
    user: "Артем",
    review:
      "Формат подачи информации понятный, хотя иногда не хватает примеров из практики.",
    date: "27.01.2025",
  },
  {
    user: "Светлана",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "08.05.2025",
  },
  {
    user: "Алексей",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "06.01.2025",
  },
  {
    user: "Алина",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "28.01.2025",
  },
  {
    user: "Татьяна",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "21.02.2025",
  },
  {
    user: "Татьяна",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "20.04.2025",
  },
  {
    user: "Артем",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "18.04.2025",
  },
  {
    user: "Никита",
    review:
      "Было бы неплохо добавить больше интерактива с подписчиками — пока всё очень односторонне.",
    date: "17.02.2025",
  },
  {
    user: "Алина",
    review:
      "Всё спокойно, без излишнего хайпа. Это мне и нравится. Можно читать на фоне.",
    date: "08.05.2025",
  },
  {
    user: "Владимир",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "05.04.2025",
  },
  {
    user: "Артем",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "11.03.2025",
  },
];

export const fakeSearchItem = {
  id: 7645248,
  tg_id: 22223035882,
  link: "https://t.me/+dS23YECfI7IwMTg6",
  peer_type: "channel",
  username: "",
  active_usernames: [],
  title: "Инспектор ГИБДД | Права быстро 👮‍♂️",
  about: `Более 6 лет оказываю помощь в оформлении водительских удостоверений и других документов.
    
    Специализируюсь на ВУ, но при необходимости могу помочь и с другими вопросами. Работаю надёжно, быстро и честно.`,
  category: "Получение ВУ / Прочие Услуги",
  country: "Россия",
  language: "Русский",
  image100: "https://i.ibb.co/N6kH4J9D/2025-05-08-18-59-19.jpg",
  image640: "https://i.ibb.co/N6kH4J9D/2025-05-08-18-59-19.jpg",
  participants_count: 22881,
  rkn_verification: {
    status: "pending",
  },
  tgstat_restrictions: [],
};

export const fakeGroupInfo = {
  id: 7645248,
  tg_id: 22223035882,
  link: "https://t.me/+dS23YECfI7IwMTg6",
  peer_type: "channel",
  username: "",
  active_usernames: [],
  title: "Инспектор ГИБДД | Права быстро 👮‍♂️",
  about: `Более 6 лет оказываю помощь в оформлении водительских удостоверений и других документов.
    
    Специализируюсь на ВУ, но при необходимости могу помочь и с другими вопросами. Работаю надёжно, быстро и честно.`,
  category: "Получение ВУ / Прочие Услуги",
  country: "Россия",
  language: "Русский",
  image100: "https://i.ibb.co/N6kH4J9D/2025-05-08-18-59-19.jpg",
  image640: "https://i.ibb.co/N6kH4J9D/2025-05-08-18-59-19.jpg",
  participants_count: 22881,
  rkn_verification: {
    status: "pending",
  },
  tgstat_restrictions: [],
};

export const trustReviews = [
  {
    user: "Смелый Пилот",
    review:
      "Не верил, что такое вообще возможно без волокиты. Но вы реально сделали это! Документы настоящие, права в базе. Спасибо за честность и внимание к деталям.",
    date: "04.01.2025",
  },
  {
    user: "Сурикат",
    review:
      "Очень доволен, как прошёл весь процесс. Честная схема, документы в порядке, никаких проблем ни на дороге, ни при проверке. Рекомендую всем, кто ценит своё время.",
    date: "02.02.2025",
  },
  {
    user: "Селиванов Александр",
    review:
      "Спасибо за профессиональный подход! Всё строго по договорённостям, без задержек. Права пришли почтой, как и обещали. На Госуслугах отображаются",
    date: "26.03.2025",
  },
  {
    user: "Григорий",
    review:
      "Все чётко и официально. Отличная поддержка в процессе. Отвечают быстро и по делу",
    date: "05.02.2025",
  },
  {
    user: "Лёха-Рок",
    review:
      "Респект! Права готовы, проверка через ГИБДД пройдена. Всё конфиденциально и без лишнего",
    date: "04.01.2025",
  },
  {
    user: "Феникс_777",
    review:
      "Удостоверение полностью официальное, уже в базе. Никаких вопросов от полиции. Лучший сервис",
    date: "27.04.2025",
  },
  {
    user: "Влада Мороз",
    review: "Если бы знала раньше — давно бы обратилась",
    date: "23.02.2025",
  },
  {
    user: "Паша",
    review: "Отличная команда, сделали всё как обещали. Без лишних разговоров.",
    date: "07.05.2025",
  },
  {
    user: "Михаил",
    review: "Очень доволен! Быстро, надёжно ",
    date: "08.03.2025",
  },
  {
    user: "МастерСлова",
    review: "Получил права через 8 дней. Всё в порядке, в базе есть",
    date: "14.02.2025",
  },
  {
    user: "Серега",
    review:
      "Не ожидал такой скорости! Через две недели уже был с документами!!",
    date: "08.05.2025",
  },
  {
    user: "Анатолий",
    review: "Спасибо что помогли. Категория С",
    date: "25.03.2025",
  },
  {
    user: "Буревестник",
    review:
      "Я контрактник, оформить права обычным способом никак не могу. Помогли быстро. Огромное спасибо!",
    date: "09.04.2025",
  },
  {
    user: "Рома ВКС",
    review: "Все четко. Добавил В и В1",
    date: "16.01.2025",
  },
  {
    user: "Беляев Данила",
    review:
      "Чесно и подумать не мог что на столько быстро получится все. Сделал себе права и забрал за 11 дней",
    date: "01.02.2025",
  },
];
