export const reviews = [
  {
    user: "Юлия",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "07.03.2025",
  },
  {
    user: "Татьяна",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "20.02.2025",
  },
  {
    user: "Юлия",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "26.04.2025",
  },
  {
    user: "Сергей",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "15.04.2025",
  },
  {
    user: "Светлана",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "29.01.2025",
  },
  {
    user: "Наталья",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "12.04.2025",
  },
  {
    user: "Артем",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "07.02.2025",
  },
  {
    user: "Татьяна",
    review:
      "Читаю канал уже несколько недель — контент, в целом, нормальный. Иногда попадаются дельные посты.",
    date: "27.01.2025",
  },
  {
    user: "Сергей",
    review:
      "Посты бывают полезные, но, честно говоря, не всегда. Канал всё ещё в закладках.",
    date: "26.03.2025",
  },
  {
    user: "Татьяна",
    review:
      "Контент в основном нейтральный, без ярко выраженной позиции. Это плюс, если хочется просто информации.",
    date: "19.01.2025",
  },
  {
    user: "Ксения",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "06.02.2025",
  },
  {
    user: "Алексей",
    review:
      "Сейчас столько каналов с однотипным контентом. Этот хоть как-то отличается спокойствием.",
    date: "10.04.2025",
  },
  {
    user: "Светлана",
    review:
      "Периодически захожу почитать, когда выдается свободное время. Интерес есть, но не постоянный.",
    date: "17.01.2025",
  },
  {
    user: "Светлана",
    review:
      "Сейчас столько каналов с однотипным контентом. Этот хоть как-то отличается спокойствием.",
    date: "26.04.2025",
  },
  {
    user: "Светлана",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "23.01.2025",
  },
  {
    user: "Елена",
    review:
      "Могли бы уделять больше внимания деталям, но за стабильность публикаций — плюс.",
    date: "04.05.2025",
  },
  {
    user: "Ольга",
    review:
      "Контент в основном нейтральный, без ярко выраженной позиции. Это плюс, если хочется просто информации.",
    date: "07.02.2025",
  },
  {
    user: "Никита",
    review:
      "Формат подачи информации понятный, хотя иногда не хватает примеров из практики.",
    date: "04.02.2025",
  },
  {
    user: "Артем",
    review:
      "Сейчас столько каналов с однотипным контентом. Этот хоть как-то отличается спокойствием.",
    date: "12.05.2025",
  },
  {
    user: "Татьяна",
    review:
      "Было бы неплохо добавить больше интерактива с подписчиками — пока всё очень односторонне.",
    date: "04.01.2025",
  },
  {
    user: "Сергей",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "18.02.2025",
  },
  {
    user: "Алина",
    review:
      "Не всегда понимаю, для какой аудитории предназначен контент. Но, возможно, это и делает его универсальным.",
    date: "20.02.2025",
  },
  {
    user: "Никита",
    review:
      "Всё спокойно, без излишнего хайпа. Это мне и нравится. Можно читать на фоне.",
    date: "16.02.2025",
  },
  {
    user: "Наталья",
    review:
      "Тематика вроде интересная, но хотелось бы побольше оригинального контента, а не просто репостов.",
    date: "17.04.2025",
  },
  {
    user: "Наталья",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "05.02.2025",
  },
  {
    user: "Алина",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "05.02.2025",
  },
  {
    user: "Татьяна",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "05.05.2025",
  },
  {
    user: "Владимир",
    review:
      "Посты бывают полезные, но, честно говоря, не всегда. Канал всё ещё в закладках.",
    date: "28.01.2025",
  },
  {
    user: "Мария",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "01.05.2025",
  },
  {
    user: "Роман",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "01.03.2025",
  },
  {
    user: "Сергей",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "14.02.2025",
  },
  {
    user: "Алина",
    review:
      "Тематика вроде интересная, но хотелось бы побольше оригинального контента, а не просто репостов.",
    date: "07.04.2025",
  },
  {
    user: "Анна",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "22.03.2025",
  },
  {
    user: "Максим",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "17.03.2025",
  },
  {
    user: "Ксения",
    review:
      "Некоторые посты явно писались наспех, но в общем и целом выглядит прилично.",
    date: "24.01.2025",
  },
  {
    user: "Алина",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "17.01.2025",
  },
  {
    user: "Роман",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "03.05.2025",
  },
  {
    user: "Ольга",
    review:
      "Контент в основном нейтральный, без ярко выраженной позиции. Это плюс, если хочется просто информации.",
    date: "28.03.2025",
  },
  {
    user: "Алексей",
    review:
      "Приятно, что авторы не навязывают своё мнение, а просто делятся материалами.",
    date: "14.03.2025",
  },
  {
    user: "Артем",
    review:
      "Формат подачи информации понятный, хотя иногда не хватает примеров из практики.",
    date: "27.01.2025",
  },
  {
    user: "Светлана",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "08.05.2025",
  },
  {
    user: "Алексей",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "06.01.2025",
  },
  {
    user: "Алина",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "28.01.2025",
  },
  {
    user: "Татьяна",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "21.02.2025",
  },
  {
    user: "Татьяна",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "20.04.2025",
  },
  {
    user: "Артем",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "18.04.2025",
  },
  {
    user: "Никита",
    review:
      "Было бы неплохо добавить больше интерактива с подписчиками — пока всё очень односторонне.",
    date: "17.02.2025",
  },
  {
    user: "Алина",
    review:
      "Всё спокойно, без излишнего хайпа. Это мне и нравится. Можно читать на фоне.",
    date: "08.05.2025",
  },
  {
    user: "Владимир",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "05.04.2025",
  },
  {
    user: "Артем",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "11.03.2025",
  },
];
