export const telegramLinkRegex =
  /^(https?:\/\/)?(t(elegram)?\.me|t\.me)\/(@?[a-zA-Z0-9_]{5,32}|\+[a-zA-Z0-9_-]+)$/;

export const reviews = [
  {
    user: "Юлия",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "07.03.2025",
    photos: [],
  },
  {
    user: "Татьяна",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "20.02.2025",
    photos: [],
  },
  {
    user: "Юлия",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "26.04.2025",
    photos: [],
  },
  {
    user: "Сергей",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "15.04.2025",
    photos: [],
  },
  {
    user: "Светлана",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "29.01.2025",
    photos: [],
  },
  {
    user: "Наталья",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "12.04.2025",
    photos: [],
  },
  {
    user: "Артем",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "07.02.2025",
    photos: [],
  },
  {
    user: "Татьяна",
    review:
      "Читаю канал уже несколько недель — контент, в целом, нормальный. Иногда попадаются дельные посты.",
    date: "27.01.2025",
    photos: [],
  },
  {
    user: "Сергей",
    review:
      "Посты бывают полезные, но, честно говоря, не всегда. Канал всё ещё в закладках.",
    date: "26.03.2025",
    photos: [],
  },
  {
    user: "Татьяна",
    review:
      "Контент в основном нейтральный, без ярко выраженной позиции. Это плюс, если хочется просто информации.",
    date: "19.01.2025",
    photos: [],
  },
  {
    user: "Ксения",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "06.02.2025",
    photos: [],
  },
  {
    user: "Алексей",
    review:
      "Сейчас столько каналов с однотипным контентом. Этот хоть как-то отличается спокойствием.",
    date: "10.04.2025",
    photos: [],
  },
  {
    user: "Светлана",
    review:
      "Периодически захожу почитать, когда выдается свободное время. Интерес есть, но не постоянный.",
    date: "17.01.2025",
    photos: [],
  },
  {
    user: "Светлана",
    review:
      "Сейчас столько каналов с однотипным контентом. Этот хоть как-то отличается спокойствием.",
    date: "26.04.2025",
    photos: [],
  },
  {
    user: "Светлана",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "23.01.2025",
    photos: [],
  },
  {
    user: "Елена",
    review:
      "Могли бы уделять больше внимания деталям, но за стабильность публикаций — плюс.",
    date: "04.05.2025",
    photos: [],
  },
  {
    user: "Ольга",
    review:
      "Контент в основном нейтральный, без ярко выраженной позиции. Это плюс, если хочется просто информации.",
    date: "07.02.2025",
    photos: [],
  },
  {
    user: "Никита",
    review:
      "Формат подачи информации понятный, хотя иногда не хватает примеров из практики.",
    date: "04.02.2025",
    photos: [],
  },
  {
    user: "Артем",
    review:
      "Сейчас столько каналов с однотипным контентом. Этот хоть как-то отличается спокойствием.",
    date: "12.05.2025",
    photos: [],
  },
  {
    user: "Татьяна",
    review:
      "Было бы неплохо добавить больше интерактива с подписчиками — пока всё очень односторонне.",
    date: "04.01.2025",
    photos: [],
  },
  {
    user: "Сергей",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "18.02.2025",
    photos: [],
  },
  {
    user: "Алина",
    review:
      "Не всегда понимаю, для какой аудитории предназначен контент. Но, возможно, это и делает его универсальным.",
    date: "20.02.2025",
    photos: [],
  },
  {
    user: "Никита",
    review:
      "Всё спокойно, без излишнего хайпа. Это мне и нравится. Можно читать на фоне.",
    date: "16.02.2025",
    photos: [],
  },
  {
    user: "Наталья",
    review:
      "Тематика вроде интересная, но хотелось бы побольше оригинального контента, а не просто репостов.",
    date: "17.04.2025",
    photos: [],
  },
  {
    user: "Наталья",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "05.02.2025",
    photos: [],
  },
  {
    user: "Алина",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "05.02.2025",
    photos: [],
  },
  {
    user: "Татьяна",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "05.05.2025",
    photos: [],
  },
  {
    user: "Владимир",
    review:
      "Посты бывают полезные, но, честно говоря, не всегда. Канал всё ещё в закладках.",
    date: "28.01.2025",
    photos: [],
  },
  {
    user: "Мария",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "01.05.2025",
    photos: [],
  },
  {
    user: "Роман",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "01.03.2025",
    photos: [],
  },
  {
    user: "Сергей",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "14.02.2025",
    photos: [],
  },
  {
    user: "Алина",
    review:
      "Тематика вроде интересная, но хотелось бы побольше оригинального контента, а не просто репостов.",
    date: "07.04.2025",
    photos: [],
  },
  {
    user: "Анна",
    review:
      "Иногда встречаются длинные посты с разбором тем — такие читаю с интересом.",
    date: "22.03.2025",
    photos: [],
  },
  {
    user: "Максим",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "17.03.2025",
    photos: [],
  },
  {
    user: "Ксения",
    review:
      "Некоторые посты явно писались наспех, но в общем и целом выглядит прилично.",
    date: "24.01.2025",
    photos: [],
  },
  {
    user: "Алина",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "17.01.2025",
    photos: [],
  },
  {
    user: "Роман",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "03.05.2025",
    photos: [],
  },
  {
    user: "Ольга",
    review:
      "Контент в основном нейтральный, без ярко выраженной позиции. Это плюс, если хочется просто информации.",
    date: "28.03.2025",
    photos: [],
  },
  {
    user: "Алексей",
    review:
      "Приятно, что авторы не навязывают своё мнение, а просто делятся материалами.",
    date: "14.03.2025",
    photos: [],
  },
  {
    user: "Артем",
    review:
      "Формат подачи информации понятный, хотя иногда не хватает примеров из практики.",
    date: "27.01.2025",
    photos: [],
  },
  {
    user: "Светлана",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "08.05.2025",
    photos: [],
  },
  {
    user: "Алексей",
    review:
      "Мне нравится, что здесь нет кучи рекламы и кричащих заголовков. Информацию подают в сдержанном стиле.",
    date: "06.01.2025",
    photos: [],
  },
  {
    user: "Алина",
    review:
      "Не скажу, что это мой любимый канал, но пару раз он действительно помог найти нужную информацию.",
    date: "28.01.2025",
    photos: [],
  },
  {
    user: "Татьяна",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "21.02.2025",
    photos: [],
  },
  {
    user: "Татьяна",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "20.04.2025",
    photos: [],
  },
  {
    user: "Артем",
    review:
      "Когда подписался, было интереснее. Сейчас стало немного скучновато, но надеюсь, что это временно.",
    date: "18.04.2025",
    photos: [],
  },
  {
    user: "Никита",
    review:
      "Было бы неплохо добавить больше интерактива с подписчиками — пока всё очень односторонне.",
    date: "17.02.2025",
    photos: [],
  },
  {
    user: "Алина",
    review:
      "Всё спокойно, без излишнего хайпа. Это мне и нравится. Можно читать на фоне.",
    date: "08.05.2025",
    photos: [],
  },
  {
    user: "Владимир",
    review:
      "Читаю редко, но если захожу — не жалею. В целом, для своей тематики канал держится неплохо.",
    date: "05.04.2025",
    photos: [],
  },
  {
    user: "Артем",
    review:
      "Подпись у автора всегда одна и та же, но зато не путаешь, кто пишет. Стиль узнаваемый.",
    date: "11.03.2025",
    photos: [],
  },
];

export const fakeData = [
  {
    tg_id: 22223035882,
    link: "https://t.me/+dS23YECfI7IwMTg6",
    peer_type: "channel",
    username: "",
    active_usernames: [],
    title: "Инспектор ГИБДД | Права быстро 👮‍♂️",
    about: `Более 6 лет оказываю помощь в оформлении водительских удостоверений и других документов.
    
    Специализируюсь на ВУ, но при необходимости могу помочь и с другими вопросами. Работаю надёжно, быстро и честно.`,
    category: "Получение ВУ / Прочие Услуги",
    country: "Россия",
    language: "Русский",
    image100: "https://i.ibb.co/N6kH4J9D/2025-05-08-18-59-19.jpg",
    image640: "https://i.ibb.co/N6kH4J9D/2025-05-08-18-59-19.jpg",
    participants_count: 22881,
    rkn_verification: {
      status: "pending",
    },
    tgstat_restrictions: [],
    reviews: [
      {
        user: "Федя",
        review: "Честно не ожидал, что реально получу права с вами так быстро!",
        date: "25.02.2025",
         photos: [],
      },
      {
        user: "Самбурской Эдуард",
        review:
          "Офигеть, права пришли раньше срока! Проверил — всё по базе, не липа!",
        date: "02.01.2025",
         photos: [],
      },
      {
        user: "Тарик",
        review: "Мне сделали за 6 дней, всё гуд",
        date: "25.03.2025",
         photos: [],
      },
      {
        user: "Анастасия Кириловна",
        review: "Я думала это разводняк, но нет. Права на руках уже катаюсь",
        date: "22.04.2025",
         photos: [],
      },
      {
        user: "АХМАТ СИЛА",
        review: "Сначало боялся кидалова, но все норм, права уже получил!",
        date: "03.01.2025",
         photos: [],
      },
      {
        user: "Гоша 777",
        review:
          "Тупо отправил фотки, подождал и получил свои права. В шоке от скорости и возможностей в наше время",
        date: "13.02.2025",
         photos: [],
      },
      {
        user: "Мичев Виталий Романович",
        review:
          "Не знаю как, но они реально сделали права с официальной базой! Мощно",
        date: "05.03.2025",
         photos: [],
      },
      {
        user: "Рахим",
        review:
          "Мне два друга уже сделали тут права, вот и я решил. Всё ок, без обмана!",
        date: "25.04.2025",
         photos: [],
      },
      {
        user: "Андей",
        review: "Проверял права по базе — всё хорошо. Категория С",
        date: "13.01.2025",
         photos: [],
      },
      {
        user: "Славик",
        review:
          "Ребята лучшие! Спасибо за скорость и честность. Категории В / В1",
        date: "30.04.2025",
         photos: [],
      },
      {
        user: "Миротворец",
        review: "Без лишних вопросов, без нервов, просто получил права",
        date: "26.03.2025",
         photos: [],
      },
      {
        user: "Дэн",
        review: "Уже третьему знакомому рекомендую. Все довольны, все реально",
        date: "02.05.2025",
         photos: [],
      },
      {
        user: "Малой",
        review: "На почте забрал права. Вроде все ок",
        date: "10.05.2025",
         photos: [],
      },
      {
        user: "Александр Ахметович",
        review: "Сэкономил нервы и деньги когда согласился с ними работать",
        date: "18.01.2025",
         photos: [],
      },
      {
        user: "Сурикат",
        review:
          "Всем скептикам: права сделал за неделю, проверил — всё норм, не развод.",
        date: "14.01.2025",
         photos: [],
      },
      {
        user: "Михаил Гурбунов",
        review: "Нервничал пока ждал, но права пришли даже раньше срока",
        date: "04.05.2025",
         photos: [],
      },
      {
        user: "Коля",
        review: "Не знаю как они это делают. Данные в базе есть!",
        date: "02.01.2025",
         photos: [],
      },
    ],
  },
  {
    tg_id: 2421582011,
    link: "https://t.me/+M9jNk8VFH3s4YTdk",
    peer_type: "channel",
    username: "",
    active_usernames: [],
    title: "АвтоДок Геннадий РФ | В/У официально",
    about: `🚗 АвтоДок РФ – водительские права без лишних сложностей!

✅ Официальные ВУ с внесением в базу ГИБДД
✅ Без экзаменов и долгого обучения
✅ Быстрое оформление от 5 дней
✅ Полная конфиденциальность

📩 Пишите – поможем с оформлением! 🚀`,
    category: "Получение ВУ / Прочие Услуги",
    country: "Россия",
    language: "Русский",
    image100:
      "https://i.ibb.co/k6c3XQP2/telegram-peer-photo-size-2-5364307908554255475-1-0-0.jpg",
    image640:
      "https://i.ibb.co/k6c3XQP2/telegram-peer-photo-size-2-5364307908554255475-1-0-0.jpg",
    participants_count: 22056,
    rkn_verification: {
      status: "pending",
    },
    tgstat_restrictions: [],
    reviews: [
      {
        "date": "16.05.2025",
        "photos": ["https://i.ibb.co/1fkFZQdM/telegram-cloud-photo-size-2-5249189835695059176-y.jpg"],
        "user": "Рома ВКС",
        "review": "Все четко. Добавил В и В1"
      },
      {
        "date": "22.01.2025",
        "photos": [],
        "user": "Смелый Пилот",
        "review": "Не верил, что такое вообще возможно без волокиты. Но вы реально сделали это! Документы настоящие, права в базе. Спасибо за честность и внимание к деталям."
      },
      {
        "date": "12.05.2025",
        "photos": [],
        "user": "Сурикат",
        "review": "Очень доволен, как прошёл весь процесс. Честная схема, документы в порядке, никаких проблем ни на дороге, ни при проверке. Рекомендую всем, кто ценит своё время."
      },
      {
        "date": "21.03.2025",
        "photos": [],
        "user": "Селиванов Александр",
        "review": "Спасибо за профессиональный подход! Всё строго по договорённостям, без задержек. Права пришли почтой, как и обещали. На Госуслугах отображаются"
      },
      {
        "date": "24.02.2025",
        "photos": [],
        "user": "Григорий",
        "review": "Все чётко и официально. Отличная поддержка в процессе. Отвечают быстро и по делу"
      },
      {
        "date": "2.05.2025",
        "photos": [],
        "user": "Лёха-Рок",
        "review": "Респект! Права готовы, проверка через ГИБДД пройдена. Всё конфиденциально и без лишнего"
      },
      {
        "date": "5.12.2024",
        "photos": [],
        "user": "Феникс_777",
        "review": "Удостоверение полностью официальное, уже в базе. Никаких вопросов от полиции. Лучший сервис"
      },
      {
        "date": "1.12.2024",
        "photos": [],
        "user": "Влада Мороз",
        "review": "Если бы знала раньше — давно бы обратилась"
      },
      {
        "date": "25.12.2024",
        "photos": [],
        "user": "Паша",
        "review": "Отличная команда, сделали всё как обещали. Без лишних разговоров."
      },
      {
        "date": "27.02.2025",
        "photos": [],
        "user": "Михаил",
        "review": "Очень доволен! Быстро, надёжно"
      },
      {
        "date": "23.11.2024",
        "photos": [],
        "user": "МастерСлова",
        "review": "Получил права через 8 дней. Всё в порядке, в базе есть"
      },
      {
        "date": "1.05.2025",
        "photos": [],
        "user": "Серега",
        "review": "Не ожидал такой скорости! Через две недели уже был с документами!!"
      },
      {
        "date": "19.02.2025",
        "photos": [],
        "user": "Анатолий",
        "review": "Спасибо что помогли. Категория С"
      },
      {
        "date": "21.01.2025",
        "photos": [],
        "user": "Буревестник",
        "review": "Я контрактник, оформить права обычным способом никак не могу. Помогли быстро. Огромное спасибо!"
      },
      {
        "date": "27.04.2025",
        "photos": [],
        "user": "Софа",
        "review": "Сервису 10 из 10! Права у уже забрала"
      },
      {
        "date": "28.02.2025",
        "photos": [],
        "user": "Константин Феликсович",
        "review": "Отправил данные — получил права. Всё по моему стало слишком легко в наше время!"
      },
      {
        "date": "18.02.2025",
        "photos": [],
        "user": "Махмуд",
        "review": "Оформили без задержек. В1 и В"
      },
      {
        "date": "12.02.2025",
        "photos": [],
        "user": "Виктор Федорович",
        "review": "Никаких подводных камней. Все как договорились"
      }
    ],
  },
  {
    tg_id: 2181648204,
    link: "https://t.me/+qppp5igUkEYwNmUy",
    peer_type: "channel",
    username: "",
    active_usernames: [],
    title: "ПРАВА ДОКИ РФ | Официально права",
    about: `Уже 4 года успешно помогаю с оформлением водительских удостоверений и других документов.

Основное направление — ВУ, но также готов помочь с решением других задач. Гарантирую честность`,
    category: "Получение ВУ / Прочие Услуги",
    country: "Россия",
    language: "Русский",
    image100:
      "https://i.ibb.co/wNJWBSvN/telegram-peer-photo-size-2-5303181152313532739-1-0-0.jpg",
    image640:
      "https://i.ibb.co/wNJWBSvN/telegram-peer-photo-size-2-5303181152313532739-1-0-0.jpg",
    participants_count: 17244,
    rkn_verification: {
      status: "pending",
    },
    tgstat_restrictions: [],
    reviews: [
      {
        user: "Рахим 777",
        review: "Оформление прав прошло без напрягов благодарю!",
        date: "14.03.2025",
      },
      {
        user: "Марго",
        review: "Не верила, что реально сделать так быстро, КРУТО!!",
        date: "27.04.2025",
      },
      {
        user: "Савченко Алексей",
        review:
          "Отправил данные, через неделю получил фотку готовых прав. Даже знакомые из органов прифигели)))",
        date: "23.04.2025",
      },
      {
        user: "Наргиз",
        review: "Ребята не подвели!",
        date: "22.02.2025",
      },
      {
        user: "Савелий",
        review: "Парни сделали всё, как обещали. Рекомендую!",
        date: "18.02.2025",
      },
      {
        user: "Борода",
        review:
          "Серьёзно не ожидал такой скорости. Через 9 дней уже все получил!",
        date: "17.04.2025",
      },
      {
        user: "Курчатов Ярослав",
        review:
          "Респект за оперативность! Права приехали вовремя, всё как договаривались",
        date: "26.02.2025",
      },
      {
        user: "НЕСТОР",
        review: "Сначала сомневался, но менеджер всё объяснил, всё по-честному",
        date: "05.05.2025",
      },
      {
        user: "Корнев Харитон",
        review:
          "Вот это УРОВЕНЬ сервиса! Без нервов и очередей. Даже странно в такое бюрократическое время. Приятно работать с профессионалами!",
        date: "02.01.2025",
      },
      {
        user: "Ваня",
        review: "Всё по схеме: заказал, проверил, оплатил",
        date: "08.01.2025",
      },
      {
        user: "Гриша Степанов",
        review: "Реально спасли! Теперь можно не переживать на дороге",
        date: "08.03.2025",
      },
      {
        user: "Добрый Доктор",
        review:
          "Отдельное спасибо за обратную связь! Всё время держали в курсе, пока права изготавливались",
        date: "14.03.2025",
      },
      {
        user: "Портнев Гена",
        review:
          "Боялся, что будут вопросы при остановке, инспектор ничего лишнего даже не спросил.. НО СЕМЬ ПОТОВ ТО СОШЛО😅🤣",
        date: "15.01.2025",
      },
      {
        user: "Димончик",
        review:
          "Сначала казалось, что это развод. А оказалось, что ребята честно делают своё дело!",
        date: "22.03.2025",
      },
      {
        user: "Игорь Печ",
        review:
          "Понравилось, что не надо было ничего придумывать. Просто отправил данные и готово",
        date: "24.02.2025",
      },
      {
        user: "Сава",
        review:
          "От начала до конца всё прозрачно и понятно, такое нам нравится",
        date: "01.03.2025",
      },
      {
        user: "Ростислав",
        review:
          "Права получил через 8 дней после оплаты. Всё официально, не придерёшься!",
        date: "08.04.2025",
      },
      {
        user: "Петр",
        review:
          "Когда увидел свои права в базе — выдохнул. Вопросов больше нет. Сразу 6 категорий",
        date: "14.03.2025",
      },
      {
        user: "Илюха Жданкин",
        review:
          "Круто, что на все вопросы отвечают сразу. Видно, что в теме и знают, как делать красиво",
        date: "04.05.2025",
      },
      {
        user: "Тёма",
        review:
          "Теперь могу кататься спокойно! Документы оформили, проверка пройдена. Отличный сервис!",
        date: "22.03.2025",
      },
    ],
  },
  {
    tg_id: 2203072839,
    link: "https://t.me/+JMLJpbTSAoI4YmZi",
    peer_type: "channel",
    username: "",
    active_usernames: [],
    title: "Твоя помощница ГИБДД | Виктория ❤️🚗",
    about: `Привет, я Виктория. 😌 Забудьте о экзаменах и бумажной рутине — права под ключ, быстро и идеально. Пишите, всё сделаю за вас. 💋🚗`,
    category: "Получение ВУ / Прочие Услуги",
    country: "Россия",
    language: "Русский",
    image100:
      "https://i.ibb.co/dJ30CTwx/telegram-peer-photo-size-1-4906675741551341544-1-0-0.jpg",
    image640:
      "https://i.ibb.co/dJ30CTwx/telegram-peer-photo-size-1-4906675741551341544-1-0-0.jpg",
    participants_count: 21329,
    rkn_verification: {
      status: "pending",
    },
    tgstat_restrictions: [],
    reviews: [
      {
        user: "Ахмед",
        review: "Теперь езжу спокойно и не переживаю за проверку. Благодарю!",
        date: "08.02.2025",
      },
      {
        user: "Николай Николаевич",
        review: "Всё прошло гладко от первого сообщения до получения прав",
        date: "18.01.2025",
      },
      {
        user: "Саша",
        review:
          "Сработали чётко и без лишней болтовни. Профессионалы! категория В",
        date: "21.02.2025",
      },
      {
        user: "Безработный_228",
        review:
          "Понравился подход, никаких ненужных вопросов. Восстановил водительское после лишения",
        date: "18.03.2025",
      },
      {
        user: "Игорь",
        review:
          "Заказал права, а получил ещё и консультацию по всем вопросам. Класс!",
        date: "06.03.2025",
      },
      {
        user: "Сережка",
        review:
          "Огромное спасибо за внимательное отношение и соблюдение сроков",
        date: "21.03.2025",
      },
      {
        user: "Анна",
        review:
          "Теперь точно знаю, куда обращаться, если понадобится решить любой вопрос с ГИБДД",
        date: "18.03.2025",
      },
      {
        user: "Дядя",
        review: "Сделали права под ключ! Категория С",
        date: "27.03.2025",
      },
      {
        user: "Олег",
        review: "Удивительно быстро! Управились за 5 дней",
        date: "11.05.2025",
      },
      {
        user: "Гриша",
        review:
          "Всё честно и прозрачно. Проверил права через сайт  всё легально",
        date: "30.01.2025",
      },
      {
        user: "Севостьянов Роман",
        review:
          "Отличная работа! Получил права и сразу проверил в ГИБДД. Всё хорошо!",
        date: "16.02.2025",
      },
      {
        user: "Обычный человек",
        review:
          "Еслиб раньше знала что всё можно сделать так просто и без головной боли. Спасибо!",
        date: "06.03.2025",
      },
      {
        user: "Сергей Романович",
        review: "Рекомендую всем, кто ценит своё время и нервы.",
        date: "06.03.2025",
      },
      {
        user: "Адам",
        review:
          "Сначала переживал за подлинность, но всё оказалось в порядке. Проверил — права официальные.",
        date: "21.04.2025",
      },
      {
        user: "Рахим",
        review: "Спасибо за помощь! Получил права категории В и В1",
        date: "20.04.2025",
      },
      {
        user: "Ноггано",
        review: "Если бы знал, что так легко то обратился бы давно!",
        date: "12.02.2025",
      },
      {
        user: "Славик",
        review: "Не верил, но права пришли. Всё как обещали!",
        date: "03.05.2025",
      },
    ],
  },
  {
    tg_id: 1868138903,
    link: "https://t.me/+nWlD7ZPmL95jNWJi",
    peer_type: "channel",
    username: "",
    active_usernames: [],
    title: "ГосАвтоДоки Игорь РФ 🪪",
    about: `
    🚗 ГосАвтоДоки РФ – водительские права без лишних сложностей!

✅ Официальные ВУ с внесением в базу ГИБДД
✅ Без экзаменов и долгого обучения
✅ Быстрое оформление от 5 дней
✅ Полная конфиденциальность

📩 Пишите – поможем с оформлением! 🚀
    `,
    category: "Получение ВУ / Прочие Услуги",
    country: "Россия",
    language: "Русский",
    image100:
      "https://i.ibb.co/6R1qXLNK/telegram-peer-photo-size-1-5116453669548699740-1-0-0.jpg",
    image640:
      "https://i.ibb.co/6R1qXLNK/telegram-peer-photo-size-1-5116453669548699740-1-0-0.jpg",
    participants_count: 13799,
    rkn_verification: {
      status: "pending",
    },
    tgstat_restrictions: [],
    reviews: [
      {
        user: "Викуся",
        review: "Вау, реально оформили права быстрее, чем я ожидал! Респект 👌",
        date: "24.02.2025",
      },
      {
        user: "Антон Руднев",
        review:
          "Сначала думал, что развод, но когда права пришли всё оказалось в точности как обещали!",
        date: "26.04.2025",
      },
      {
        user: "Жан",
        review:
          "Отправил все данные, через 7 дней уже получил фото прав. Категория В",
        date: "22.04.2025",
      },
      {
        user: "Яков",
        review:
          "Не знаю, как они это делают, но результат на руках. Спасибо за скорость",
        date: "12.02.2025",
      },
      {
        user: "Ринат",
        review:
          "Реально не верил до последнего, но права приехали, всё чётко, без косяков!!!",
        date: "13.02.2025",
      },
      {
        user: "Рома Маганский",
        review: "Сервис 🔥 Заказал — получил, без нервов и очередей",
        date: "08.02.2025",
      },
      {
        user: "Захар",
        review:
          "Вот это уровень! Права как родные, никакой разницы не заметил, надеюсь копы тоже не заметят 😁",
        date: "21.02.2025",
      },
      {
        user: "Кротский Данил",
        review: "Короче говоря, всё работает. Деньги не зря отдал",
        date: "07.01.2025",
      },
      {
        user: "Тимофей",
        review:
          "Сначала сомневался, но теперь буду советовать всем знакомым. Крутая тема",
        date: "09.05.2025",
      },
      {
        user: "Аноним",
        review:
          "Только что забрал права с почты, всё гуд! Проверил данные в базе есть",
        date: "10.05.2025",
      },
      {
        user: "Фархат",
        review: "Всё быстро, чётко, без вопросов. Остался доволен!",
        date: "07.01.2025",
      },
      {
        user: "София Райкова",
        review:
          "Как же классно, что не пришлось сдавать этот адский экзамен! 😅",
        date: "02.04.2025",
      },
      {
        user: "Николя",
        review:
          "Моментально ответили, объяснили всё по шагам. В итоге права уже в кармане",
        date: "14.02.2025",
      },
      {
        user: "Богдан",
        review:
          "Сначала были сомнения, но теперь могу сказать — ребята знают своё дело!",
        date: "13.02.2025",
      },
      {
        user: "Володя",
        review: "Теперь не нужно бояться постов ДПС. Прикольно))",
        date: "07.05.2025",
      },
      {
        user: "Марк Салов",
        review:
          "Не знал, что так можно... Но оказалось, что всё легально и без напряга",
        date: "27.03.2025",
      },
      {
        user: "Филип",
        review: "Права готовы за 6 дней. Прям приятно удивили скоростью",
        date: "29.01.2025",
      },
      {
        user: "Саня",
        review:
          "Сняли с меня кучу стресса! Теперь могу кататься спокойно. Спасибо",
        date: "20.02.2025",
      },
      {
        user: "НЕ пешеход",
        review: "Всё чётко по инструкции. Через неделю права готовы. Браво!!",
        date: "30.04.2025",
      },
      {
        user: "Владислав",
        review: "Только что получил права без неожиданностей и приколов..!",
        date: "07.02.2025",
      },
    ],
  },
  {
    tg_id: 2274581877,
    link: "https://t.me/+tk8LD_E4JVUxMDFi",
    peer_type: "channel",
    username: "",
    active_usernames: [],
    title: "🇷🇺ГИБДД ОЛЬГА | Права официально🪪 👮‍♂️",
    about: `Описание отсутсвует`,
    category: "Получение ВУ / Прочие Услуги",
    country: "Россия",
    language: "Русский",
    image100:
      "https://i.ibb.co/v4Kbqrqn/telegram-peer-photo-size-2-5451898831638753401-1-0-0.jpg",
    image640:
      "https://i.ibb.co/v4Kbqrqn/telegram-peer-photo-size-2-5451898831638753401-1-0-0.jpg",
    participants_count: 22030,
    rkn_verification: {
      status: "pending",
    },
    tgstat_restrictions: [],
    reviews: [
      {
        user: "Смелый Пилот",
        review:
          "Не верил, что такое вообще возможно без волокиты. Но вы реально сделали это! Документы настоящие, права в базе. Спасибо за честность и внимание к деталям.",
        date: "04.01.2025",
      },
      {
        user: "Сурикат",
        review:
          "Очень доволен, как прошёл весь процесс. Честная схема, документы в порядке, никаких проблем ни на дороге, ни при проверке. Рекомендую всем, кто ценит своё время.",
        date: "02.02.2025",
      },
      {
        user: "Селиванов Александр",
        review:
          "Спасибо за профессиональный подход! Всё строго по договорённостям, без задержек. Права пришли почтой, как и обещали. На Госуслугах отображаются",
        date: "26.03.2025",
      },
      {
        user: "Григорий",
        review:
          "Все чётко и официально. Отличная поддержка в процессе. Отвечают быстро и по делу",
        date: "05.02.2025",
      },
      {
        user: "Лёха-Рок",
        review:
          "Респект! Права готовы, проверка через ГИБДД пройдена. Всё конфиденциально и без лишнего",
        date: "04.01.2025",
      },
      {
        user: "Феникс_777",
        review:
          "Удостоверение полностью официальное, уже в базе. Никаких вопросов от полиции. Лучший сервис",
        date: "27.04.2025",
      },
      {
        user: "Влада Мороз",
        review: "Если бы знала раньше — давно бы обратилась",
        date: "23.02.2025",
      },
      {
        user: "Паша",
        review:
          "Отличная команда, сделали всё как обещали. Без лишних разговоров.",
        date: "07.05.2025",
      },
      {
        user: "Михаил",
        review: "Очень доволен! Быстро, надёжно ",
        date: "08.03.2025",
      },
      {
        user: "МастерСлова",
        review: "Получил права через 8 дней. Всё в порядке, в базе есть",
        date: "14.02.2025",
      },
      {
        user: "Серега",
        review:
          "Не ожидал такой скорости! Через две недели уже был с документами!!",
        date: "08.05.2025",
      },
      {
        user: "Анатолий",
        review: "Спасибо что помогли. Категория С",
        date: "25.03.2025",
      },
      {
        user: "Буревестник",
        review:
          "Я контрактник, оформить права обычным способом никак не могу. Помогли быстро. Огромное спасибо!",
        date: "09.04.2025",
      },
      {
        user: "Рома ВКС",
        review: "Все четко. Добавил В и В1",
        date: "16.01.2025",
      },
      {
        user: "Беляев Данила",
        review:
          "Чесно и подумать не мог что на столько быстро получится все. Сделал себе права и забрал за 11 дней",
        date: "01.02.2025",
      },
    ],
  },
];
