"use client";

import Container from "../layouts/Container";
import TyphographyH1 from "../typography/TyphographyH1";
import TyphographyP from "../typography/TyphographyP";
import TypographyH2 from "../typography/TypographyH2";

export default function page() {
  return (
    <Container>
      <section className="w-full flex flex-col gap-y-4 h-full min-h-screen">
        <TyphographyH1 className="text-primary">
          Политика конфиденциальности
        </TyphographyH1>
        <TyphographyP className="text-primary !text-xs">
          Настоящая политика конфиденциальности (далее – «Политика») разработана
          в соответствии с Федеральным законом от 27.07.2006 № 152-ФЗ «О
          персональных данных» и устанавливает правила использования сайта
          персональной информации, получаемой от пользователей сайта
          tg-scaner.ru, являющихся гражданами Российской Федерации (далее –
          «Пользователи»). Текст Политики доступен Пользователям в сети Интернет
          по сетевому адресу https://tg-scaner.ru/privacy. Использование сайта
          tg-scaner.ru (далее – «Сайт») означает выражение Пользователем
          безоговорочного согласия с Политикой и указанными условиями обработки
          информации.
        </TyphographyP>
        <TypographyH2 className="text-primary">
          1. Информация, получаемая Сервисом
        </TypographyH2>
        <TyphographyP className="text-primary">
          1.1. Сервис собирает, получает доступ и использует в определенных
          Политикой целях персональные данные Пользователя, техническую и иную
          информацию, связанную с Пользователем. <br /> 1.2. Под технической
          информацией понимается информация, которая автоматически передается
          Сервису в процессе использования Сайта с помощью установленного на
          устройстве Пользователя программного обеспечения. Техническая
          информация не является персональными данными. Сервис использует файлы
          cookies и аналогичные технологии, которые позволяют идентифицировать
          устройство Пользователя. Файлы cookies – это текстовые файлы,
          доступные Сервису для обработки информации об активности устройства
          Пользователя. Пользователь может отключить возможность использования
          файлов cookies в настройках браузера. <br /> 1.3. Под персональными
          данными Пользователя понимается информация, которую Пользователь
          предоставляет Сервису с помощью Сайта и при последующем взаимодействии
          с Сервисом, в том числе: <br /> 1.3.1. фамилия, имя, отчество; <br />{" "}
          1.3.2. адрес электронной почты; <br /> 1.3.3. страна и город
          проживания; <br /> 1.3.4. номер электронного кошелька Пользователя в
          платежных системах. <br /> 1.4. Сервис обрабатывает персональные
          данные, техническую информацию и иную информацию Пользователя в
          течение всего срока действия заключенного с Пользователем соглашения,
          а в случае отсутствия такого соглашения – в течение 10 (десяти) лет с
          момента предоставления указанной информации.
          <br />
          1.5. Сайт не является общедоступным источником персональных данных.
          При этом в случае совершения Пользователем определенных действий его
          персональные данные могут стать доступными неопределенному кругу лиц,
          о чем настоящим Пользователь дает свое согласие.
        </TyphographyP>
        <TypographyH2 className="text-primary">
          2. Цели использования информации, предоставляемой Пользователем
        </TypographyH2>
        <TyphographyP className="text-primary">
          2.1. Информация, предоставленная Пользователем, используется Сервисом
          исключительно в целях: <br /> 2.1.1. заключения между Сервисом и
          Пользователем соглашения, а также исполнения Сервисом такого
          соглашения; <br /> 2.1.2. обеспечения Пользователя технической
          поддержкой; <br />
          2.1.3. рассмотрения обращений и претензий Пользователя; <br /> 2.1.4.
          направления Пользователю информационных материалов; <br /> 2.1.5.
          улучшения работы и модернизации Сайта;
        </TyphographyP>
        <TypographyH2 className="text-primary">
          3. Способы обработки{" "}
        </TypographyH2>
        <TyphographyP className="text-primary">
          3.1. Обработка персональных данных Пользователя означает запись,
          систематизацию, накопление, хранение, уточнение (обновление,
          изменение), извлечение, использование, передачу (распространение,
          предоставление, доступ), обезличивание, блокирование, удаление,
          уничтожение персональных данных Пользователя, не подпадающих под
          специальные категории, на обработку которых Сервису, согласно
          действующему законодательству Российской Федерации, требуется
          письменное согласие Пользователя. <br />
          <br /> 3.2. Пользователь дает свое согласие Сервису на обработку
          персональных данных Пользователя, предоставляемых при заполнении любой
          формы на Сайте и в ходе дальнейшего взаимодействия с Сайтом, в том
          числе на передачу таких персональных данных третьим лицам во
          исполнение соглашения между Сервисом и Пользователем, даже когда такая
          передача осуществляется на территорию иных государств (трансграничная
          передача). <br />
          <br /> 3.3. Для удобства пользователя и для предоставления нашего
          сервиса мы можем потребовать от вас, прямо или косвенно, предоставить
          нам определенную личную информацию, включая, помимо прочего, имя
          пользователя и учетные данные Oauth2. Информация, которую мы
          запрашиваем, будет сохранена нами и использована для авторизации
          пользователя на нашем ресурсе. Приложение использует сторонние
          сервисы, которые могут собирать информацию, используемую для вашей
          идентификации. Ссылки на политику конфиденциальности сторонних
          поставщиков услуг, используемых приложением: Google Sign-in Services.
        </TyphographyP>
        <TypographyH2 className="text-primary">
          4. Меры, принимаемые для защиты предоставляемой Пользователем
          информации, и гарантии Сервисом
        </TypographyH2>
        <TyphographyP className="text-primary">
          4.1. Сервис принимает необходимые и достаточные правовые,
          организационные и технические меры для защиты информации,
          предоставляемой Пользователями, от неправомерного или случайного
          доступа, уничтожения, изменения, блокирования, копирования,
          распространения, а также от иных неправомерных действий с ней третьих
          лиц, путем ограничения доступа к такой информации иных Пользователей
          Сайта, Сервиса, сотрудников и партнеров Сервиса, третьих лиц (за
          исключением предоставления Сервисом информации, необходимой для
          исполнения Сервисом обязательств перед Пользователем и требований
          российского законодательства), а также наложения на таких лиц санкций
          за нарушение режима конфиденциальности в отношении таких данных.{" "}
          <br /> 4.2. Сервис гарантирует, что предоставленная Пользователями
          информация не объединяется со статистическими данными, не
          предоставляется третьим лицам и не разглашается, за исключением
          случаев, предусмотренных в Политике.
        </TyphographyP>
        <TypographyH2 className="text-primary">5. Права Сервиса</TypographyH2>
        <TyphographyP className="text-primary">
          5.1. Сервис вправе проводить статистические и иные исследования на
          основе обезличенной информации, предоставленной Пользователем. Сервис
          вправе предоставлять доступ к таким исследованиям третьим лицам для
          осуществления таргетинга рекламы. Пользователь также может
          самостоятельно (при наличии технической возможности на устройстве
          Пользователя или в программных средствах на устройстве Пользователя)
          запретить устройству или программным средствам передавать через Сайт
          информацию, необходимую для осуществления таргетинга рекламы. <br />{" "}
          5.2. Сервис вправе предоставить информацию о Пользователях третьим
          лицам для выявления и пресечения мошеннических действий, для
          устранения технических неполадок или проблем с безопасностью, а также
          в иных случаях, предусмотренных законодательством Российской
          Федерации. <br /> 5.3. Сервис вправе предоставлять доступ к информации
          о Пользователе третьим лицам, если такая передача необходима для
          исполнения Сервисом соглашения, заключенного с Пользователем. <br />{" "}
          5.4. В случае отзыва Пользователем согласия на обработку персональных
          данных, Сервис вправе ограничить доступ Пользователя к некоторым или
          всем функциям Сайта.
        </TyphographyP>
        <TypographyH2 className="text-primary">
          6. Права Пользователя
        </TypographyH2>
        <TyphographyP className="text-primary">
          6.1. Пользователь может в любое время отозвать согласие на обработку
          персональных данных, направив Сервису соответствующее письменное
          уведомление на почтовый адрес Сервиса support@tg-scaner.ru. При этом
          Пользователь понимает, что Сервис вправе продолжить обработку такой
          информации в случаях, допустимых применимым законодательством.
        </TyphographyP>
        <TypographyH2 className="text-primary">7. Новые редакции</TypographyH2>
        <TyphographyP className="text-primary">
          7.1. Сервис оставляет за собой право вносить изменения в Политику. На
          Пользователе лежит обязанность при каждом обращении к Сайту
          знакомиться с текстом Политики. <br /> 7.2. Новая редакция Политики
          вступает в силу по истечении 5 календарных дней с момента ее
          размещения. Продолжение использования Сайта после вступления в силу
          новой редакции Политики означает принятие Политики и ее условий
          Пользователем. <br /> 7.3. Пользователь не должен пользоваться Сайтом,
          если Пользователь не согласен с условиями Политики.
        </TyphographyP>
        <TypographyH2 className="text-primary">
          8. Исключение противоречий
        </TypographyH2>
        <TyphographyP className="text-primary">
          8.1. В случае, когда соглашение между Сервисом и Пользователем
          содержит положения об использовании персональной информации и/или
          персональных данных Пользователя, применяются положения Политики и
          такого соглашения в части, не противоречащей Политике.
        </TyphographyP>
      </section>
    </Container>
  );
}
