"use client";

import Container from "../layouts/Container";
import TyphographyH1 from "../typography/TyphographyH1";
import TyphographyP from "../typography/TyphographyP";

export default function page() {
  return (
    <Container>
      <section className="w-full flex flex-col gap-y-4 h-full min-h-screen">
        <TyphographyH1 className="text-primary">
          Пользовательское соглашение
        </TyphographyH1>
        <TyphographyP className="text-primary">
          1. Администрация веб-сайта «Репутация в Сети» далее по тексту
          Администрация, не берется судить о каком-то ни было веб-сайте, а
          только предоставляет информацию о проверяемых сайтах из других
          источников и дает возможность пользователям интернета, после
          предварительной регистрации оставлять отзывы и составлять рейтинг
          доверия любому веб-сайту по своему усмотрению.
          <br />
          <br />
          2. Со стороны Администрации будут приложены все усилия, чтобы не
          допустить размещения ложной информации о каком-то ни было веб-сайте.
          <br />
          <br />
          3. Все регистрационные и другие данные зарегистрированных
          пользователей являются конфиденциальной информацией.
          <br />
          <br />
          4. Администрация имеет право по своему усмотрению отказать
          пользователю в предоставлении услуг полностью или частично, если будет
          выявлен факт злоупотребления мультирегистрациями.
          <br />
          <br />
          5. Администрация имеют право в любое время вносить изменения в
          настоящие Правила путем помещения на веб-сайте rep-vseti.ru новой
          версии в полном виде. Новые Правила вступают в силу с момента их
          публикации.
          <br />
          <br />
          6. Пользователем веб-сайта «Репутация в Сети» может стать любое лицо,
          пришедшее на веб-сайт rep-vseti.ru и принимающее на себя обязанности
          безусловного соблюдения данных Правил в форме открытой оферты.
          <br />
          <br />
          7. На веб-сайте запрещено клевета, запугивание, оскорбления,
          преследование, угрозы, дискриминация в отношении других лиц или
          нарушение прав, (таких как право на личную жизнь и гласность)
          каким-либо образом, других лиц, а также раскрытие чужой личной
          информации другим лицам.
          <br />
          <br />
          8. Если вы используете этот веб-сайт, нарушив настоящие Правила, или
          если вы неоднократно нарушали эти Правила или авторские права третьих
          лиц, мы оставляем за собой право прекратить доступ к веб-сайту.
          <br />
          <br />
          9. Администрация оставляет за собой право по собственному усмотрению,
          немедленно и без предварительного уведомления, приостановить или
          прекратить ваш доступ к веб-сайту, контенту, услуге или любой его
          части по любой причине, включая, без ограничений, любые нарушения вами
          настоящих Правил. Вы соглашаетесь, что Администрация не несет
          ответственности перед вами или любой третьей стороной за такое
          приостановление или прекращение вашего доступа к веб-сайту.
          <br />
          <br />
          10. Администрация оставляет за собой право в любое время, или время от
          времени, изменять, приостанавливать, блокировать, прекращать временно
          или постоянно доступ к веб-сайту, контенту или услуге, или любой его
          части, с, или без, предварительного уведомления. Вы соглашаетесь, что
          Администрация не несет ответственности перед вами или любой третьей
          стороной ни за какое изменение, приостановление, блокирование,
          прекращение доступа к веб-сайту, контенту или услуге.
          <br />
          <br />
          11. Администрация не несет ответственности за любое неправомерное
          использование веб-сайта или незаконные действия, связанные с
          веб-сайтом со стороны пользователя.
          <br />
          <br />
          12. Администрация , при любых обстоятельствах, не несет ни какой
          ответственности за оставленные пользователями отзывы и за составленные
          на их основе рейтинги.
          <br />
          <br />
          13. Администрация , при любых обстоятельствах, освобождается от исков
          третьих лиц по факту: нанесения вреда имиджу , потере прибыли,
          снижения ожидаемой прибыли, ущерба (материального или морального) и
          других претензий , связанных с отзывами пользователей и выстроенными
          рейтингами компаний.
          <br />
          <br />
          14. Администрация обязуется удалить любую информацию с сайта ,
          признанную недействительной по решению суда.
          <br />
          <br />
          15. Администрация обязуется оказывать информационную поддержку
          правоохранительным органам в случае возбуждения уголовного дела по
          факту размещенной на нашем ресурсе информации в части установления
          личности пользователя оставившего не правомерный отзыв.
          <br />
          <br />
          3. Публикация сообщений.
          <br />
          <br />
          3.1 Название темы должно быть информативным и давать возможность
          понять содержание темы до чтения сообщения.
          <br />
          <br />
          3.2 Тема сообщения должна соответствовать теме раздела, в котором она
          помещена.
          <br />
          <br />
          3.3 Не рекомендуется использовать в названии темы различного рода
          украшения (символы, предназначенные лишь для визуального выделения
          темы, не несущие смысловой нагрузки).
          <br />
          <br />
          3.4 Запрещается писать название темы заглавными буквами.
          <br />
          <br />
          3.5 Перед созданием новой темы рекомендуется проверить, не обсуждалась
          ли она ранее, с помощью поиска.
          <br />
          <br />
          3.6 Запрещается публикация оскорбительных, угрожающих,
          порнографических, клеветнических сообщений и ссылок на такие
          сообщения, призывов к национальной розни и прочих сообщений, могущих
          нарушающих законодательство.
          <br />
          <br />
          3.7 Не рекомендуется избыточное цитирование. Как Правило, размер
          цитаты не должен превышать трех-четырех строк текста.
          <br />
          <br />
          3.8 Запрещено помещение одинаковых по смыслу сообщений в разные темы.
          <br />
          <br />
          3.9 Запрещено использование в сообщениях нецензурных слов, брани,
          оскорбительных для других участников выражений.
          <br />
          <br />
          3.10 Запрещено помещение сообщений, содержащих заведомо ложнyю
          инфоpмацию, клеветy, а также нечестные приемы ведения дискуссий.
          <br />
          <br />
          3.11 Запрещается чрезмерное использование графических изображений
          (смайликов) в сообщении (более трёх подряд) Запрещается вставлять в
          сообщение рисунок размером более 50Кб. Такие рисунки можно указывать в
          виде ссылки.
          <br />
          <br />
          3.12 Не рекомендуется избыточное использование знаков препинания.
          <br />
          <br />
          3.13 Запрещено избыточное применение ВЕРХНЕГО регистра в тексте
          сообщений.
          <br />
          <br />
          3.14 Темы, в которых нет сообщений в течение двух месяцев - модераторы
          имеют права закрыть.
          <br />
          <br />
          3.15 За любое нарушение модератор имеет право забанить аккаунт от 1 до
          30 дней на своё усмотрение. За повторное нарушение любого из правил от
          1 месяца до постоянного.
        </TyphographyP>
        <span className="font-bold text-primary text-sm text-center border-2 border-primary rounded-md p-2">
          Администрация оставляет за собой право на внесение изменений в
          настоящие Правила без предупреждения или уведомления об этом. Новые
          Правила вступают в силу с момента опубликования на этой странице.
        </span>
      </section>
    </Container>
  );
}
